{
  "products": [
    {
      "id": "1",
      "title": "Fjallraven - Foldsack No. 1 Backpack, Fits 15 Laptops",
      "price": 109.95,
      "description": "Your perfect pack for everyday use and walks in the forest. Stash your laptop (up to 15 inches) in the padded sleeve, your everyday",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": "2",
      "title": "Mens Casual Premium Slim Fit T-Shirts ",
      "price": 22.3,
      "description": "Slim-fitting style, contrast raglan long sleeve, three-button henley placket, light weight & soft fabric for breathable and comfortable wearing. And Solid stitched shirts with round neck made for durability and a great fit for casual fashion wear and diehard baseball fans. The Henley style round neckline includes a three-button placket.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71-3HjGNDUL._AC_SY879._SX._UX._SY._UY_.jpg",
      "rating": {
        "rate": 4.1,
        "count": 259
      }
    },
    {
      "id": "3",
      "title": "Mens Cotton Jacket",
      "price": 55.99,
      "description": "great outerwear jackets for Spring/Autumn/Winter, suitable for many occasions, such as working, hiking, camping, mountain/rock climbing, cycling, traveling or other outdoors. Good gift choice for you or your family member. A warm hearted love to Father, husband or son in this thanksgiving or Christmas Day.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71li-ujtlUL._AC_UX679_.jpg",
      "rating": {
        "rate": 4.7,
        "count": 500
      }
    },
    {
      "id": "4",
      "title": "Mens Casual Slim Fit",
      "price": 15.99,
      "description": "The color could be slightly different between on the screen and in practice. / Please note that body builds vary by person, therefore, detailed size information should be reviewed below on the product description.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71YXzeOuslL._AC_UY879_.jpg",
      "rating": {
        "rate": 2.1,
        "count": 430
      }
    },
    {
      "id": "5",
      "title": "John Hardy Women's Legends Naga Gold & Silver Dragon Station Chain Bracelet",
      "price": 695,
      "description": "From our Legends Collection, the Naga was inspired by the mythical water dragon that protects the ocean's pearl. Wear facing inward to be bestowed with love and abundance, or outward for protection.",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/71pWzhdJNwL._AC_UL640_QL65_ML3_.jpg",
      "rating": {
        "rate": 4.6,
        "count": 400
      }
    },
    {
      "id": " 6",
      "title": "Solid Gold Petite Micropave ",
      "price": 168,
      "description": "Satisfaction Guaranteed. Return or exchange any order within 30 days.Designed and sold by Hafeez Center in the United States. Satisfaction Guaranteed. Return or exchange any order within 30 days.",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/61sbMiUnoGL._AC_UL640_QL65_ML3_.jpg",
      "rating": {
        "rate": 3.9,
        "count": 70
      }
    },
    {
      "id": "7",
      "title": "White Gold Plated Princess",
      "price": 9.99,
      "description": "Classic Created Wedding Engagement Solitaire Diamond Promise Ring for Her. Gifts to spoil your love more for Engagement, Wedding, Anniversary, Valentine's Day...",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/71YAIFU48IL._AC_UL640_QL65_ML3_.jpg",
      "rating": {
        "rate": 3,
        "count": 400
      }
    },
    {
      "id": "8",
      "title": "Pierced Owl Rose Gold Plated Stainless Steel Double",
      "price": 10.99,
      "description": "Rose Gold Plated Double Flared Tunnel Plug Earrings. Made of 316L Stainless Steel",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
      "rating": {
        "rate": 1.9,
        "count": 100
      }
    },
    {
      "id": "9",
      "title": "WD 2TB Elements Portable External Hard Drive - USB 3.0 ",
      "price": 64,
      "description": "USB 3.0 and USB 2.0 Compatibility Fast data transfers Improve PC Performance High Capacity; Compatibility Formatted NTFS for Windows 10, Windows 8.1, Windows 7; Reformatting may be required for other operating systems; Compatibility may vary depending on user’s hardware configuration and operating system",
      "category": "electronics",
      "image": "https://fakestoreapi.com/img/61IBBVJvSDL._AC_SY879_.jpg",
      "rating": {
        "rate": 3.3,
        "count": 203
      }
    },
    {
      "id": "10",
      "title": "SanDisk SSD PLUS 1TB Internal SSD - SATA III 6 Gb/s",
      "price": 109,
      "description": "Easy upgrade for faster boot up, shutdown, application load and response (As compared to 5400 RPM SATA 2.5” hard drive; Based on published specifications and internal benchmarking tests using PCMark vantage scores) Boosts burst write performance, making it ideal for typical PC workloads The perfect balance of performance and reliability Read/write speeds of up to 535MB/s/450MB/s (Based on internal testing; Performance may vary depending upon drive capacity, host device, OS and application.)",
      "category": "electronics",
      "image": "https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg",
      "rating": {
        "rate": 2.9,
        "count": 470
      }
    },
    {
      "id": "11",
      "title": "Silicon Power 256GB SSD 3D NAND A55 SLC Cache Performance Boost SATA III 2.5",
      "price": 109,
      "description": "3D NAND flash are applied to deliver high transfer speeds Remarkable transfer speeds that enable faster bootup and improved overall system performance. The advanced SLC Cache Technology allows performance boost and longer lifespan 7mm slim design suitable for Ultrabooks and Ultra-slim notebooks. Supports TRIM command, Garbage Collection technology, RAID, and ECC (Error Checking & Correction) to provide the optimized performance and enhanced reliability.",
      "category": "electronics",
      "image": "https://fakestoreapi.com/img/71kWymZ+c+L._AC_SX679_.jpg",
      "rating": {
        "rate": 4.8,
        "count": 319
      }
    }
  ],
  "articles": [
    {
      "id": "1",
      "author": "Zac Crellin",
      "title": "Protesters attempt to storm Tesla's factory in Berlin",
      "description": "Environmentalists have long criticized Tesla for clearing sections of a forest in order to build its electric car factory outside Berlin. A police spokesperson said the situation remained \"dynamic.\" Activists attempted to break into Tesla's electric car facto…",
      "url": "https://www.dw.com/en/protesters-attempt-to-storm-teslas-factory-in-berlin/a-69046103",
      "urlToImage": "https://static.dw.com/image/69046169_6.jpg",
      "publishedAt": "2024-05-10T13:12:00Z",
      "content": "Activists attempted to break into Tesla's electric car factory outside Berlin on Friday, according topolice. \r\nRegional broadcaster RBB reported that several hundred people ran toward the Tesla facil… [+710 chars]"
    },
    {
      "id": "2",
      "author": "Morgan Meaker",
      "title": "Climate Protestors Storm Tesla's Gigafactory in Europe",
      "description": "The carmaker’s only European gigafactory has become the target of increasingly radical protests since announcing expansion plans.",
      "url": "https://www.wired.com/story/climate-protestors-storm-teslas-europe-gigafactory/",
      "urlToImage": "https://media.wired.com/photos/663e1a1dff22bdec82842b75/191:100/w_1280,c_limit/Tesla.jpg",
      "publishedAt": "2024-05-10T13:08:01Z",
      "content": "Protesters charged onto Teslas factory site near Berlin on Friday, as part of a five-day demonstration against the carmakers local expansion plans.\r\nFootage on social media showed crowds of black-cla… [+2337 chars]"
    },
    {
      "id": "3",
      "author": "the us sun",
      "title": "Anarchists storm TESLA factory in Germany after 'Vulkan Group' declares war...",
      "description": "A GROUP of angry black-clad anarchists has clashed with police as it stormed the Tesla giga-factory in Brandenburg. Dramatic footage shows demonstrators defying cops and breaking through police lin…",
      "url": "https://www.the-sun.com/news/11331758/moment-army-anarchists-tesla-giga-factory-germany/",
      "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2024/05/2024-near-gruenheide-germany-activists-900318925.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
      "publishedAt": "2024-05-10T13:00:03Z",
      "content": "A GROUP of angry black-clad anarchists has clashed with police as it stormed the Tesla giga-factory in Brandenburg.\r\nDramatic footage shows demonstrators defying cops and breaking through police line… [+4887 chars]"
    },
    {
      "id": "4",
      "author": "Owen Bellwood",
      "title": "Departing Tesla Exec Can’t ‘See The Long Game’ As Layoffs Hit Morale, Stock Price",
      "description": "Good morning! It’s Friday, May 10, 2024, and this is The Morning Shift, your daily roundup of the top automotive headlines from around the world, in one place. Here are the important stories you need to know.Read more...",
      "url": "https://jalopnik.com/departing-tesla-exec-can-t-see-the-long-game-as-layof-1851468607",
      "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d63dcb77fad338a5e52bae8da03cfe5e.jpg",
      "publishedAt": "2024-05-10T13:00:00Z",
      "content": "Good morning! Its Friday, May 10, 2024, and this is The Morning Shift, your daily roundup of the top automotive headlines from around the world, in one place. Here are the important stories you need … [+7087 chars]"
    },
    {
      "id": "5",
      "author": "Victor Tangermann",
      "title": "Smugglers Busted Trying to Sneak Cybertrucks Into Russia",
      "description": "To Russia With Love Tesla-obsessed vigilantes reportedly attempted to smuggle two Tesla Cybertrucks into Russia — but got caught well before they could get there. As Electrek reports, the pair of oddball pickup trucks were seized by Lithuanian customs while t…",
      "url": "https://futurism.com/the-byte/smugglers-busted-sneak-cybertrucks-russia",
      "urlToImage": "https://wp-assets.futurism.com/2024/05/smugglers-busted-sneak-cybertrucks-russia2.jpg",
      "publishedAt": "2024-05-10T12:58:55Z",
      "content": "No Cybertruck for you, comrade.\r\nTo Russia With Love\r\nTesla-obsessed vigilantes reportedly attempted to smuggle two Tesla Cybertrucks into Russia but got caught well before they could get there.\r\nAs … [+2006 chars]"
    },
    {
      "id": "6",
      "author": "Investing.com",
      "title": "Needham trims Blink Charging stock PT as bookings dip before Tesla's impact surge",
      "description": "Needham trims Blink Charging stock PT as bookings dip before Tesla's impact surge",
      "url": "https://www.investing.com/news/company-news/needham-trims-blink-charging-stock-pt-as-bookings-dip-before-teslas-impact-surge-93CH-3434632",
      "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEE310MM_L.jpg",
      "publishedAt": "2024-05-10T12:57:23Z",
      "content": "On Friday, Blink Charging Co. (NASDAQ:BLNK) had its price target lowered by Needham, now set at $6.00, decreasing from the previous $7.00, while the firm maintained a Buy rating on the stock. The adj… [+3079 chars]"
    },
    {
      "id": "7",
      "author": "investors.com",
      "title": "Vultures Circle As Elon Musk Says This On Superchargers Following Layoffs",
      "description": "Tesla stock is down on the week. The post Vultures Circle As Elon Musk Says This On Superchargers Following Layoffs appeared first on Investor's Business Daily.",
      "url": "https://biztoc.com/x/e413858d5cab2cc8",
      "urlToImage": "https://c.biztoc.com/274/og.png",
      "publishedAt": "2024-05-10T12:56:09Z",
      "content": "Tesla stock is down on the week.The post Vultures Circle As Elon Musk Says This On Superchargers Following Layoffs appeared first on Investor's Business Daily.\r\nThis story appeared on investors.com, … [+10 chars]"
    },
    {
      "id": "8",
      "author": "Keelan Balderson",
      "title": "22 Shocking AI Electricity Usage Statistics for 2024 and Beyond",
      "description": "AI is taking the world by storm and innovating industries in ways never thought possible. But today, I crunched the numbers to find the most shocking AI electricity usage statistics. The sheer amount of data and processing power it takes to train and develop …",
      "url": "https://mspoweruser.com/ai-electricity-usage/",
      "urlToImage": "https://mspoweruser.com/wp-content/uploads/2024/05/ai-electricity-usage.png",
      "publishedAt": "2024-05-10T12:54:37Z",
      "content": "AI is taking the world by storm and innovating industries in ways never thought possible. But today, I crunched the numbers to find the most shocking AI electricity usage statistics.\r\nThe sheer amoun… [+8902 chars]"
    }
  ]
}